
SUBROUTINE FIRST()
USE PARAM_
USE PARAM_1
USE N_
USE RAILWAY
USE FReciverGlobals

IMPLICIT NONE
INTEGER*4 SIZE					! пюглепмнярэ люяяхбю гюцнкнбйю
INTEGER*4 I,J,NF1,NF2
INTEGER*4 II						! рнвйю люйяхлслю б рпюяяе		
INTEGER*4 JJ
REAL*4 RABMAX						! цкюбмюъ кхмхъ
REAL*4 RSUM_MIDL					! йнмрпнкэмюъ ясллю япедмецн дкъ бшдекемхъ нярюмнбйх
REAL*4 RSUM_RDM					! йнмрпнкэмюъ ясллю дкъ бшдекемхъ нярюмнбйх

!--------------------------------------------------------------------------------------------
ITEK=ITEK+1				! рейсыее гмювемхе напюаюршбюелни б щрн опнжедспе рпюяяш
!--------------------------------------------------------------------------------------------
!	N=SIZE	-1
!--------------------------------------------------------------------------------------------
! ЦНРНБХЛЯЪ Й БНГЛНФМНЛС ОПНОСЯЙС РПЮЯЯ-------------------------------
if(itek.lt.10)out_trassa=1
!---------------------------------------------------------------------
DO N_CHEN_TEK=1,N_CHEN					! жхйк он йюмюкюл
IF(IPR_CHEN(N_CHEN_TEK).EQ.0) THEN
    do i = 1, n
	rdm(i) = MyTrassa((N_CHEN_TEK-1)*N+i)
    end do
ELSE
    do i = 1, n
	rdm(i) = 0.
    end do 
    GOTO 776
END IF    
!--------------------------------------------------------------------------------------------
! нопедекъел  люйяхлсл яхцмюкю опълнцн опнунфдемхъ рейсыеи рпюяяш, мнплхпсел мю 10000 х бшпюбмхбюел рпюяяш он люйяхлслс
!--------------------------------------------------------------------------------------------
CALL RMAX(RDM,POROG1,N,II)			! хяонкэгселше оюпюлерпш - POROG1/4 йнцдю яхцмюк опълнцн опнунфдемхъ лемэье 
                                        ! нрпюфемхъ нр якнъ)


IF(II.GT.0.AND. II.LT.N) THEN
    IF(RDM(II).LT.POROG_INTENS)THEN
    IPR_CHEN(N_CHEN_TEK)=1	
    do i = 1, n
	rdm(i) = 0.
    end do  
    GOTO 776
    ELSE
    IPR_CHEN(N_CHEN_TEK)=0	
    END IF
END IF

                                    
!------------------------------------------------------------------------------------------------
CALL NORM(RDM,N,II)						! мнплхпсел яхцмюк рюй,
										! врнаш яхцмюк опълнцн опнунфдемхъ ашк пюбем 1000
!------------------------------------------------------------------------------------------------
CALL LEVEL(RDM,RDM1,J_LEVEL,II,N)		! опхбндхл й ндмнлс спнбмч J_LEWEL
DO I=1,N								! оепегюохяэ мюгюд
RDM(I)=RDM1(I)
END DO
!-------------------------------------------------------------------------------------------------
! еякх HH_B пюбмн мскч (дбхфеляъ он онбепумнярх), рн намскъел бшье онбепумнярх.
! еякх HH_B ме пюбмн мскч (пюанрюел я бюцнмю хкх рекефйх), рн намскъел опхлепмн дн аюккюярю
!-------------------------------------------------------------------------------------------------
JJ=JJ_H+J_LEVEL-1             
IF(JJ.GE.N)JJ=N
DO I=1,JJ								
RDM(I)=0.
END DO
!--------------------------------------------------------------------------------------------
! нопедекъел юаянкчрмши люйяхлсл рейсыеи рпюяяш х бшпюбмхбюел рпюяяш он спнбмч яхцмюкю
! нрпюфемхъ нр онбепумнярх
!--------------------------------------------------------------------------------------------
IF(JJ_H.GT.1.0) THEN
CALL RMAX(RDM,POROG1,N,II)			    ! хяонкэгселше оюпюлерпш - POROG1
										! оняке намскемхъ
!CALL NORM(RDM,N,II)						! мнплхпсел яхцмюк рюй,
										! врнаш яхцмюк опълнцн опнунфдемхъ ашк пюбем 10000
CALL LEVEL(RDM,RDM1,J_LEVEL,II,N)		! опхбндхл й ндмнлс спнбмч J_LEWEL

DO I=1,J_LEVEL-1								! оепегюохяэ мюгюд
RDM(I)=0.0
END DO
DO I=J_LEVEL,N								    ! оепегюохяэ мюгюд
RDM(I)=RDM1(I)
END DO
END IF

!--------------------------------------------------------------------------------------------
!янупюмъел яхцмюк б астепе дкъ сяпедмемхъ
IF(L_REGION.GT.0.AND.M_REGION.GT.0) THEN
    IF(ITEK.LE.L_REGION)THEN
	    DO I=1,N
	    BUFF(N_CHEN_TEK,I,ITEK)=RDM(I)
	    END DO
    ELSE
        I=ITEK-ITEK/L_REGION*L_REGION+1 ! жхйкхвеяйюъ гюохяэ
	    DO J=1,N
		BUFF(N_CHEN_TEK,J,I)=RDM(J)
	    END DO
    END IF
!--------------------------------------------------------------------------------------------
! сяпедмъел рпюяяш
    CALL MIDLE(N_CHEN_TEK,N_CHEN,RDM,BUFF,L_REGION,M2_REGION,J_LEVEL,N,ITEK)
    CALL NORM(RDM,N,J_LEVEL)						! мнплхпсел яхцмюк мю аюккюяре
END IF
!--------------------------------------------------------------------------------------------
! тхкэрпсел яхцмюк
IF(POROG2.GT.0.0)THEN
CALL FOURIE(POROG2,N,RDM,RDM1)
! намскъел бшье J_LEWEL
DO I=1,J_LEVEL-1
RDM(I)=0.
END DO
DO I=J_LEVEL,N
RDM(I)=RDM1(I)
END DO 
END IF
!--------------------------------------------------------------------------------------------
! пюявер нрпюфюрекэмни яонянамнярх (бкюфмнярэ)
	CALL REFR_POSIBILITY(N_CHEN_TEK) ! пюявер нрпюфюрекэмни яонянамнярх
    CALL REFR_FORPRINT()             ! юмюкхг хгнапюфемхъ бкюфмнярх
!	REFR_KR=(REFR_KR*(ITEK-1)+REFR_MIDL)/ITEK
!--------------------------------------------------------------------------------------------
!янупюмъел яхцмюк б астепе дкъ бшвхрюмхъ
IF(KEY_MIDL.GT.0) THEN                                              ! йкчв бшвхрюмхъ япедмеи рпюяяш
    IF(ITEK.LE.KEY_MIDL)THEN
            IF(N_CHEN_TEK.EQ.1)KEY_MIDL1=KEY_MIDL1+1
            DO I=1,N  
            BUFF_MIDDLE(N_CHEN_TEK,I,ITEK)=RDM(I)    
            SUM_MIDDLE(N_CHEN_TEK,I)=SUM_MIDDLE(N_CHEN_TEK,I)+RDM(I)
            END DO
    ELSE
            KEY_MIDL1=KEY_MIDL
            J=ITEK-ITEK/KEY_MIDL*KEY_MIDL+1 ! жхйкхвеяйюъ гюохяэ
            DO I=1,N
            SUM_MIDDLE(N_CHEN_TEK,I)=SUM_MIDDLE(N_CHEN_TEK,I)-BUFF_MIDDLE(N_CHEN_TEK,I,J)+RDM(I)
            BUFF_MIDDLE(N_CHEN_TEK,I,J)=RDM(I)
            END DO            
    END IF
    END IF
!--------------------------------------------------------------------------------------------
! дн напюанрйх бшвхрюел япедмее
!--------------------------------------------------------------------------------------------
	RSUM_RDM=0.
	DO I=1,N										! дкъ сяпедмемхъ
	RSUM_RDM=RSUM_RDM+ABS(RDM(I))
	SUM_RAB_MIDL(N_CHEN_TEK,I)=SUM_RAB_MIDL(N_CHEN_TEK,I)+RDM(I)
	END DO
	RSUM_MIDL=0.
	    IF(ITEK.GT.1)THEN
        IF(KEY_MIDL.LT.0) GOTO 1
        DO I=1,N										! сяпедмемхE
	    RSUM_MIDL=RSUM_MIDL+ABS(SUM_RAB_MIDL(N_CHEN_TEK,I))
        IF(KEY_MIDL.EQ.0) THEN
            RDM(I)=-SUM_RAB_MIDL(N_CHEN_TEK,I)/ITEK+RDM(I) 
        ELSE
            RDM(I)=-SUM_MIDDLE(N_CHEN_TEK,I)/KEY_MIDL1+RDM(I)            
        END IF
        END DO
        END IF
!--------------------------------------------------------------------------------------------
! еякх ярнхл, рн ме напюаюршбюел
!--------------------------------------------------------------------------------------------
1	RSUM_MIDL=RSUM_MIDL/ITEK
	IF(ABS(RSUM_RDM-RSUM_MIDL).LT.RSUM_MIDL*0.03) THEN
        IF(ITEK.GT.1)THEN
	    DO I=1,N										! сяпедмемхE
        RDM(I)=SUM_RAB_MIDL(N_CHEN_TEK,I)/(ITEK-1)
        END DO
        END IF
    END IF
!------------------------------------------------------------------------
! сяхкхбюел
!------------------------------------------------------------------------
IF(RMULTIPLE.GT.0.0)CALL MAGNIFICATION(RDM,N,J_LEVEL,RMULTIPLE)
!------------------------------------------------------------------------
! нопедекъел рнкэйн онкнфхрекэмше люйяхлслш бшье онпнцнбнцн гмювемхъ
!-------------------------------------------------------------------------
!   CALL Gilbert(N,RDM,RDM1)
!------------------------------------------------------------------------
CALL RMAX_PLUS(RDM,RDM1,N,POROG,J_LEVEL,RABMAX)
! бнгбпюыюел напюанрюммсч рпюяяс дкъ пхянбюмхъ х дкъ юмюкхгю
do i=1,n
    rdm2(i,N_CHEN_TEK)=rdm(i)
end do

!---------------------------------------------------------
!  бшдекемхе цкюбмшу кхмхи яепхх
! --------------------------------------------------------
CALL MAIN_LINE(POROG1,J_LEVEL,RDM,N)
! бнгбпюыюел напюанрюммсч рпюяяс дкъ пхянбюмхъ
!---------------------------------------------------------
!  ондюбкемхе йпюрмшу нрпюфемхи
! --------------------------------------------------------
IF(KEY_REFLECTION.EQ.0)CALL MULTIPLE_REFLECTION(J_LEVEL,RDM,N)
!---------------------------------------------------------
!--------------------------------------------------------------
! пюявер лнлемрю якнеб
	CALL SUM_MOMENT(N_CHEN_TEK)	! пюявер лнлемрю якнеб
!--------------------------------------------------------------

! бнгбпюыюел напюанрюммсч рпюяяс дкъ юмюкхгю

776 CONTINUE

    do i = 1, n
	  MyTrassa((N_CHEN_TEK-1)*N+i)=rdm(i)
    end do
 END DO                                                     ! жхйк он йюмюкюл
777 RETURN
END SUBROUTINE FIRST

!open(unit=100, FILE='D:/OUTPUT.OUT')
!write(100,*) 
!open(unit=100, FILE='D:/OUTPUT.OUT')
!IF(N_CHEN_TEK.EQ.1)write(100,*) itek,RDM(J_LEVEL)



